In [1]:
import pandas as pd

In [2]:
from pathlib import Path

EXCELS_DIR = r"C:\Users\andre\IdeaProjects\TyuiuDirectionsRecSys\data\10 лет"

files = {}
for file_path in Path(EXCELS_DIR).iterdir():
    year = str(file_path).split(".")[0][-4:]
    files[year] = file_path
files

{'2014': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2014.xls'),
 '2015': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2015.xls'),
 '2016': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2016.xls'),
 '2017': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2017.xls'),
 '2018': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2018.xls'),
 '2019': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2019.xlsx'),
 '2020': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2020.xlsx'),
 '2021': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2021.xlsx'),
 '2022': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2022.xlsx'),
 '2023': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2023.xlsx'),
 '2024': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2024.xlsx')}

In [3]:
df_2014 = pd.read_excel(files["2014"])

In [4]:
df_2014 = df_2014[["Территориальное подр.", "Зачислен на направление подготовки (специальность)", "Форма освоения", "Зачислен по виду возмещения затрат", "Сумма баллов"]]
df_2014.head(3)

,Территориальное подр.,Зачислен на направление подготовки (специальность),Форма освоения,Зачислен по виду возмещения затрат,Сумма баллов
0,г. Тюмень,21.03.01 Нефтегазовое дело (Академический бака...,Очная,бюджет,184
1,г. Тюмень,21.03.01 Нефтегазовое дело (Академический бака...,Очная,по договору,123
2,г. Тюмень,"38.03.02 Менеджмент (Академический бакалавр, К...",Очная,бюджет,185

In [5]:
df_2014 = df_2014[df_2014["Территориальное подр."] == "г. Тюмень"]
df_2014 = df_2014[df_2014["Форма освоения"] == "Очная"]
df_2014 = df_2014[df_2014["Зачислен по виду возмещения затрат"] == "бюджет"]
df_2014.head(3)

,Территориальное подр.,Зачислен на направление подготовки (специальность),Форма освоения,Зачислен по виду возмещения затрат,Сумма баллов
0,г. Тюмень,21.03.01 Нефтегазовое дело (Академический бака...,Очная,бюджет,184
2,г. Тюмень,"38.03.02 Менеджмент (Академический бакалавр, К...",Очная,бюджет,185
4,г. Тюмень,21.05.02 Прикладная геология (Горный инженер-г...,Очная,бюджет,170

In [6]:
df_2014 = df_2014.groupby('Зачислен на направление подготовки (специальность)')['Сумма баллов'].min().reset_index()
df_2014.head(5)

  Зачислен на направление подготовки (специальность)  Сумма баллов
0  05.03.01 Геология (Академический бакалавр, Каф...           133
1  09.03.01 Информатика и вычислительная техника ...           136
2  09.03.02 Информационные системы и технологии (...           146
3  12.03.01 Приборостроение (Академический бакала...           146
4  12.03.04 Биотехнические системы и технологии (...           113

In [7]:
df_2014["Год"] = 2014

In [8]:
df_2014.to_csv("ТИУ_проходные_баллы_2014.csv")

In [9]:
df_2015 = pd.read_excel(files["2015"])
df_2015 = df_2015[["Форма обучения", "Вид приема", "Филиал",  "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2015.head(3)

,Форма обучения,Вид приема,Филиал,"Направление, специальность, профессия",Итоговая сумма баллов
0,Заочная,По договору,Тюменский индустриальный университет,21.03.01 Нефтегазовое дело,"49,00"
1,Заочная,По договору,филиал ТИУ в г. Тобольске,13.03.02 Электроэнергетика и электротехника,"80,00"
2,Заочная,По договору,Тюменский индустриальный университет,21.03.01 Нефтегазовое дело,"52,00"

In [10]:
df_2015 = df_2015[df_2015["Филиал"] == "Тюменский индустриальный университет"]
df_2015 = df_2015[df_2015["Форма обучения"] == "Очная"]
df_2015 = df_2015[df_2015["Вид приема"] == "Общий конкурс"]
df_2015.head(3)

,Форма обучения,Вид приема,Филиал,"Направление, специальность, профессия",Итоговая сумма баллов
5,Очная,Общий конкурс,Тюменский индустриальный университет,12.03.01 Приборостроение,"178,00"
18,Очная,Общий конкурс,Тюменский индустриальный университет,21.05.02 Прикладная геология,"214,00"
46,Очная,Общий конкурс,Тюменский индустриальный университет,27.03.04 Управление в технических системах,"210,00"

In [11]:
df_2015["Итоговая сумма баллов"] = pd.to_numeric(df_2015['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')

In [12]:
df_2015 = df_2015.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2015["Год"] = 2015
df_2015.head(3)

           Направление, специальность, профессия  Итоговая сумма баллов   Год
0                              05.03.01 Геология                  165.0  2015
1  09.03.01 Информатика и вычислительная техника                  169.0  2015
2   09.03.02 Информационные системы и технологии                  163.0  2015

In [13]:
df_2015.to_csv("ТИУ_проходные_баллы_2015.csv")

In [14]:
df_2016 = pd.read_excel(files["2016"])
df_2016 = df_2016[["Форма обучения", "Вид приема", "Филиал",  "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2016 = df_2016[df_2016["Филиал"] == "Тюменский индустриальный университет"]
df_2016 = df_2016[df_2016["Форма обучения"] == "Очная"]
df_2016 = df_2016[df_2016["Вид приема"] == "Общий конкурс"]
df_2016.head(3)

,Форма обучения,Вид приема,Филиал,"Направление, специальность, профессия",Итоговая сумма баллов
2,Очная,Общий конкурс,Тюменский индустриальный университет,27.03.04 Управление в технических системах,"170,00"
4,Очная,Общий конкурс,Тюменский индустриальный университет,12.03.04 Биотехнические системы и технологии,"232,00"
6,Очная,Общий конкурс,Тюменский индустриальный университет,05.03.01 Геология,"207,00"

In [15]:
df_2016["Итоговая сумма баллов"] = pd.to_numeric(df_2016['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')
df_2016 = df_2016.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2016["Год"] = 2016
df_2016.head(3)

  Направление, специальность, профессия  Итоговая сумма баллов   Год
0                     05.03.01 Геология                  156.0  2016
1                  07.03.01 Архитектура                  308.0  2016
2   07.03.03 Дизайн архитектурной среды                  293.0  2016

In [16]:
df_2016.to_csv("ТИУ_проходные_баллы_2016.csv")

In [17]:
df_2017 = pd.read_excel(files["2017"])
df_2017 = df_2017[["Форма обучения", "Вид приема", "Филиал", "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2017 = df_2017[df_2017["Филиал"] == "Тюменский индустриальный университет"]
df_2017 = df_2017[df_2017["Форма обучения"] == "Очная"]
df_2017 = df_2017[df_2017["Вид приема"] == "Общий конкурс"]
df_2017.head(3)

,Форма обучения,Вид приема,Филиал,"Направление, специальность, профессия",Итоговая сумма баллов
0,Очная,Общий конкурс,Тюменский индустриальный университет,21.05.02 Прикладная геология,"217,00"
3,Очная,Общий конкурс,Тюменский индустриальный университет,21.03.01 Нефтегазовое дело,"231,00"
4,Очная,Общий конкурс,Тюменский индустриальный университет,21.05.02 Прикладная геология,"264,00"

In [18]:
df_2017["Итоговая сумма баллов"] = pd.to_numeric(df_2017['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')
df_2017 = df_2017.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2017["Год"] = 2017
df_2017.head(3)

  Направление, специальность, профессия  Итоговая сумма баллов   Год
0                     05.03.01 Геология                  185.0  2017
1                  07.03.01 Архитектура                  304.0  2017
2   07.03.03 Дизайн архитектурной среды                  292.0  2017

In [19]:
df_2017.to_csv("ТИУ_проходные_баллы_2017.csv")

In [20]:
df_2018 = pd.read_excel(files["2018"])
df_2018 = df_2018[["Форма обучения", "Вид приема", "Филиал", "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2018 = df_2018[df_2018["Филиал"] == "Тюменский индустриальный университет"]
df_2018 = df_2018[df_2018["Форма обучения"] == "Очная"]
df_2018 = df_2018[df_2018["Вид приема"] == "Общий конкурс"]
df_2018.head(3)

,Форма обучения,Вид приема,Филиал,"Направление, специальность, профессия",Итоговая сумма баллов
0,Очная,Общий конкурс,Тюменский индустриальный университет,21.05.02 Прикладная геология,"217,00"
3,Очная,Общий конкурс,Тюменский индустриальный университет,21.03.01 Нефтегазовое дело,"231,00"
4,Очная,Общий конкурс,Тюменский индустриальный университет,21.05.02 Прикладная геология,"264,00"

In [21]:
df_2018["Итоговая сумма баллов"] = pd.to_numeric(df_2018['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')
df_2018 = df_2018.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2018["Год"] = 2018
df_2018.head(3)

  Направление, специальность, профессия  Итоговая сумма баллов   Год
0                     05.03.01 Геология                  185.0  2018
1                  07.03.01 Архитектура                  304.0  2018
2   07.03.03 Дизайн архитектурной среды                  292.0  2018

In [22]:
df_2018.to_csv("ТИУ_проходные_баллы_2018.csv")

In [24]:
df_2019 = pd.read_excel(files["2019"])
df_2019 = df_2019[["Форма обучения", "Вид приема", "Филиал", "Направление подготовки", "Сумма баллов"]]
df_2019 = df_2019[df_2019["Филиал"] == "Тюменский индустриальный университет"]
df_2019 = df_2019[df_2019["Форма обучения"] == "Очная"]
df_2019 = df_2019[df_2019["Вид приема"] == "Общий конкурс"]
df_2019.head(3)

,Форма обучения,Вид приема,Филиал,Направление подготовки,Сумма баллов
6,Очная,Общий конкурс,Тюменский индустриальный университет,27.03.01 Стандартизация и метрология,210
7,Очная,Общий конкурс,Тюменский индустриальный университет,08.03.01 Строительство,190
8,Очная,Общий конкурс,Тюменский индустриальный университет,08.03.01 Строительство,214

In [26]:
# df_2019["Сумма баллов"] = pd.to_numeric(df_2019['Сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')
df_2019 = df_2019.groupby('Направление подготовки')['Сумма баллов'].min().reset_index()
df_2019["Год"] = 2019
df_2019.head(3)

                Направление подготовки  Сумма баллов   Год
0                    05.03.01 Геология           201  2019
1                 07.03.01 Архитектура           284  2019
2  07.03.03 Дизайн архитектурной среды           279  2019

In [27]:
df_2019.to_csv("ТИУ_проходные_баллы_2019.csv")

In [28]:
df_2020 = pd.read_excel(files["2020"])
df_2020 = df_2020[["Форма обучения", "Вид приема", "Филиал", "Направление подготовки", "Сумма баллов"]]
df_2020 = df_2020[df_2020["Филиал"] == "Тюменский индустриальный университет"]
df_2020 = df_2020[df_2020["Форма обучения"] == "Очная"]
df_2020 = df_2020[df_2020["Вид приема"] == "Общий конкурс"]
df_2020.head(3)

,Форма обучения,Вид приема,Филиал,Направление подготовки,Сумма баллов
0,Очная,Общий конкурс,Тюменский индустриальный университет,18.03.01 Химическая технология,199
1,Очная,Общий конкурс,Тюменский индустриальный университет,07.03.01 Архитектура,315
2,Очная,Общий конкурс,Тюменский индустриальный университет,08.03.01 Строительство,242

In [29]:
df_2020 = df_2020.groupby('Направление подготовки')['Сумма баллов'].min().reset_index()
df_2020["Год"] = 2020
df_2020.head(3)

                         Направление подготовки  Сумма баллов   Год
0  01.03.02 Прикладная математика и информатика           200  2020
1      02.03.01 Математика и компьютерные науки           178  2020
2                             05.03.01 Геология           156  2020

In [30]:
df_2020.to_csv("ТИУ_проходные_баллы_2020.csv")

In [31]:
df_2021 = pd.read_excel(files["2021"])
df_2021 = df_2021[["Форма обучения", "Вид приема", "Филиал", "Направление подготовки", "Сумма баллов"]]
df_2021 = df_2021[df_2021["Филиал"] == "Тюменский индустриальный университет"]
df_2021 = df_2021[df_2021["Форма обучения"] == "Очная"]
df_2021 = df_2021[df_2021["Вид приема"] == "Общий конкурс"]
df_2021.head(3)

,Форма обучения,Вид приема,Филиал,Направление подготовки,Сумма баллов
1,Очная,Общий конкурс,Тюменский индустриальный университет,20.03.01 Техносферная безопасность,172
3,Очная,Общий конкурс,Тюменский индустриальный университет,21.03.01 Нефтегазовое дело,246
6,Очная,Общий конкурс,Тюменский индустриальный университет,"21.05.00 Прикладная геология, горное дело, неф...",215

In [32]:
df_2021 = df_2021.groupby('Направление подготовки')['Сумма баллов'].min().reset_index()
df_2021["Год"] = 2021
df_2021.head(3)

                         Направление подготовки  Сумма баллов   Год
0  01.03.02 Прикладная математика и информатика           212  2021
1                             05.03.01 Геология           174  2021
2                          07.03.01 Архитектура           301  2021

In [33]:
df_2021.to_csv("ТИУ_проходные_баллы_2021.csv")

In [34]:
df_2022 = pd.read_excel(files["2022"])
df_2022 = df_2022[["Форма обучения", "Вид приема", "Филиал", "Направление подготовки", "Сумма баллов"]]
df_2022 = df_2022[df_2022["Филиал"] == "Тюменский индустриальный университет"]
df_2022 = df_2022[df_2022["Форма обучения"] == "Очная"]
df_2022 = df_2022[df_2022["Вид приема"] == "Общий конкурс"]
df_2022.head(3)

,Форма обучения,Вид приема,Филиал,Направление подготовки,Сумма баллов
1,Очная,Общий конкурс,Тюменский индустриальный университет,22.03.01 Материаловедение и технологии материалов,166
2,Очная,Общий конкурс,Тюменский индустриальный университет,08.03.01 Строительство,157
8,Очная,Общий конкурс,Тюменский индустриальный университет,21.03.01 Нефтегазовое дело,272

In [35]:
df_2022 = df_2022.groupby('Направление подготовки')['Сумма баллов'].min().reset_index()
df_2022["Год"] = 2022
df_2022.head(3)

                         Направление подготовки  Сумма баллов   Год
0  01.03.02 Прикладная математика и информатика           227  2022
1      02.03.01 Математика и компьютерные науки           219  2022
2                             05.03.01 Геология           145  2022

In [36]:
df_2022.to_csv("ТИУ_проходные_баллы_2022.csv")

In [37]:
df_2023 = pd.read_excel(files["2023"])
df_2023 = df_2023[["Форма обучения", "Вид приема", "Филиал", "Направление подготовки", "Сумма баллов"]]
df_2023 = df_2023[df_2023["Филиал"] == "Тюменский индустриальный университет"]
df_2023 = df_2023[df_2023["Форма обучения"] == "Очная"]
df_2023 = df_2023[df_2023["Вид приема"] == "Общий конкурс"]
df_2023.head(3)

,Форма обучения,Вид приема,Филиал,Направление подготовки,Сумма баллов
2,Очная,Общий конкурс,Тюменский индустриальный университет,28.03.03 Наноматериалы,130
3,Очная,Общий конкурс,Тюменский индустриальный университет,08.03.01 Строительство,186
4,Очная,Общий конкурс,Тюменский индустриальный университет,"21.05.00 Прикладная геология, горное дело, неф...",226

In [38]:
df_2023 = df_2023.groupby('Направление подготовки')['Сумма баллов'].min().reset_index()
df_2023["Год"] = 2023
df_2023.head(3)

                         Направление подготовки  Сумма баллов   Год
0  01.03.02 Прикладная математика и информатика           238  2023
1                             05.03.01 Геология           179  2023
2                          07.03.01 Архитектура           304  2023

In [39]:
df_2023.to_csv("ТИУ_проходные_баллы_2023.csv")

In [40]:
df_2024 = pd.read_excel(files["2024"])
df_2024 = df_2024[["Форма обучения", "Вид приема", "Филиал", "Направление подготовки", "Сумма баллов"]]
df_2024 = df_2024[df_2024["Филиал"] == "Тюменский индустриальный университет"]
df_2024 = df_2024[df_2024["Форма обучения"] == "Очная"]
df_2024 = df_2024[df_2024["Вид приема"] == "Общий конкурс"]
df_2024.head(3)

,Форма обучения,Вид приема,Филиал,Направление подготовки,Сумма баллов
0,Очная,Общий конкурс,Тюменский индустриальный университет,21.03.02 Землеустройство и кадастры,247
1,Очная,Общий конкурс,Тюменский индустриальный университет,43.03.00 Сервис и туризм,234
2,Очная,Общий конкурс,Тюменский индустриальный университет,28.03.03 Наноматериалы,187

In [41]:
df_2024 = df_2024.groupby('Направление подготовки')['Сумма баллов'].min().reset_index()
df_2024["Год"] = 2024
df_2024.head(3)

                         Направление подготовки  Сумма баллов   Год
0  01.03.02 Прикладная математика и информатика           249  2024
1                             05.03.01 Геология           186  2024
2                          07.03.01 Архитектура           302  2024

In [42]:
df_2024.to_csv("ТИУ_проходные_баллы_2024.csv")